# Iris Data Set Notebook
***

### Within this notebook is my analysis of the Iris Data Set.
Author: Roisin Stanley


### References.
***
https://raw.githubusercontent.com/mwaskom/seaborn-data/71e2436a092d714350de0fc409ca8a8714e7e78f/iris.csv
Raw data taken from Github page belonging to the inventor of Seaborn.

https://en.wikipedia.org/wiki/Iris_flower_data_set

https://archive.ics.uci.edu/dataset/53/iris # looked at this but decided not to use.

In [1]:
### Import Libraries.
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [3]:
### read in data from url.
data = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/71e2436a092d714350de0fc409ca8a8714e7e78f/iris.csv")

In [5]:
### see all data
print(data)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [7]:
### all the values of first row will be present
data.iloc[0]

0             5.1
1             3.5
2             1.4
3             0.2
species    setosa
Name: 0, dtype: object

In [9]:
# first five
data.head()

     0    1    2    3 species
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa
2  4.7  3.2  1.3  0.2  setosa
3  4.6  3.1  1.5  0.2  setosa
4  5.0  3.6  1.4  0.2  setosa

In [11]:
### last five
data.tail()

       0    1    2    3    species
145  6.7  3.0  5.2  2.3  virginica
146  6.3  2.5  5.0  1.9  virginica
147  6.5  3.0  5.2  2.0  virginica
148  6.2  3.4  5.4  2.3  virginica
149  5.9  3.0  5.1  1.8  virginica

In [13]:
###
data.sample(10)

       0    1    2    3     species
112  6.8  3.0  5.5  2.1   virginica
141  6.9  3.1  5.1  2.3   virginica
123  6.3  2.7  4.9  1.8   virginica
91   6.1  3.0  4.6  1.4  versicolor
24   4.8  3.4  1.9  0.2      setosa
145  6.7  3.0  5.2  2.3   virginica
30   4.8  3.1  1.6  0.2      setosa
32   5.2  4.1  1.5  0.1      setosa
27   5.2  3.5  1.5  0.2      setosa
26   5.0  3.4  1.6  0.4      setosa

In [15]:
### Showing the Types of data - floats and objects
data.dtypes

0          float64
1          float64
2          float64
3          float64
species     object
dtype: object

In [17]:
### renamed columns 0,1,2,3 and showed every 50th row easier to read
col = ["sepal_length", "sepal_width", "petal_length", "petal_width"]
data.rename(columns={col[0]:0, col[1]:1, col[2]:2, col[3]:3},inplace=True)
data.iloc[::50]

       0    1    2    3     species
0    5.1  3.5  1.4  0.2      setosa
50   7.0  3.2  4.7  1.4  versicolor
100  6.3  3.3  6.0  2.5   virginica

In [19]:
### looking at the columns
data.columns

Index([0, 1, 2, 3, 'species'], dtype='object')

In [21]:

###
print (data.shape)
data.describe() # Gives statistical overview

(150, 5)

                0           1           2           3
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.057333    3.758000    1.199333
std      0.828066    0.435866    1.765298    0.762238
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [23]:
# Showing info from species column eg there is 3 species and 50 of each
data.species.value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

***